{
  "links": [
    {
      "title": "Making GitHub’s new homepage fast and performant",
      "description": "The GitHub engineering team shares interesting details about the performance optimizations for the Github homepage.",
      "link": "https://github.blog/2021-01-29-making-githubs-new-homepage-fast-and-performant/"
    },
    {
      "title": "Making password managers play ball with your login form",
      "description": "A great summary on how to properly support password manages in login forms by Hidde de Vries.",
      "link": "https://hiddedevries.nl/en/blog/2018-01-13-making-password-managers-play-ball-with-your-login-form"
    },
    {
      "title": "Ultimate Laravel Performance Checklist",
      "description": "You can increase the performance of Laravel applications with many small changes. Paras Malhotra shared a checklist to optimize the performance of your application.",
      "link": "https://laravel-news.com/performance-checklist"
    },
    {
      "title": "JS Minification Benchmarks",
      "description": "There are several tools available to properly minify your JS scripts. This benchmark checks the performance of the most popular tools.",
      "link": "https://github.com/privatenumber/minification-benchmarks"
    },
    {
      "title": "PhpClean - small steps to the perfect code",
      "description": "You can make your PHP code much more readable and consistent with PhpClean, a coding strategy and ruleset, which is available as a plugin for PhpStorm.",
      "link": "https://funivan.com/post/phpclean-intro/"
    },
    {
      "title": "ZSH Tricks to blow your mind",
      "description": "The folks of Twilio compiled a list of the best tricks and tipps for the ZSH shell.",
      "link": "https://www.twilio.com/blog/zsh-tricks-to-blow-your-mind"
    },
    {
      "title": "The Future of Web Software is HTML-over-WebSockets",
      "description": "The future of web-based software architectures is already taking form, and this time it’s server-rendered (again).",
      "link": "https://alistapart.com/article/the-future-of-web-software-is-html-over-websockets/"
    },
    {
      "title": "Front-of-the-front-end and back-of-the-front-end",
      "description": "Brad Frost shares the idea of two different layers in frontend web development: the front and back end.",
      "link": "https://bradfrost.com/blog/post/front-of-the-front-end-and-back-of-the-front-end-web-development/"
    }
  ]
}
